app/controllers/authentications_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "bar_location", "bar_telephone", "bar_image", "is_bar", "bar_size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def register
    p user_params
    user = User.new(user_params)
    if user.save