app/controllers/events_controller.rb

  def create
    @event = current_user.events.new(event_params)

    if @event.save
---
INSERT INTO "events" ("user_id", "date", "is_expired", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["date", 2017-02-25 20:00:00 UTC], ["is_expired", "no"], ["description", "Description of event"], ["created_at", 2017-02-22 15:22:49 UTC], ["updated_at", 2017-02-22 15:22:49 UTC]]